app/controllers/media_contents_controller.rb

SELECT "media".* FROM "media"
---
  def index
    @media_contents = Media.all

INSERT INTO "media" ("created_at", "file_name", "lat", "lng", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-06-05 02:22:06.625760"], ["file_name", "image3.jpg"], ["lat", "38.89881388888889"], ["lng", "38.89881388888889"], ["updated_at", "2015-06-05 02:22:06.625760"]]
---
 def create
    @media = Media.new(
            file: params[:file],
            lat: params[:lat],
            lng: params[:lng])
    if @media.save!

DELETE FROM "media" WHERE "media"."id" = $1  [["id", 1]]
SELECT "media".* FROM "media"  WHERE "media"."id" IS NULL
---
  def delete_media
    Media.where(id: params[:media_contents]).destroy_all